Workspace/test_cases/vertificating/Acoustic-test/3DRoomAcoustic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
364500
(
101325
101325
101325
101325
101325
101325
101325
101325
...
)
;

boundaryField
{
    fixedWalls
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101325;
        lInf            3;
        value           uniform 101325;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
