Workspace/test_cases/vertificating/Acoustic-test/3DRoomAcoustic/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

